<?php

return [
    'tabs' => [
        'general' => 'Загальні',
        'styling' => 'Стилізація',
        'scheduling' => 'Планування',
    ],
    'fields' => [
        'id' => 'ID',
        'name' => 'Назва',
        'content' => 'Контент',
        'render_location' => 'Місце відображення',
        'render_location_help' => 'Вибравши місце відображення, ви можете визначити, де банер буде відображатися на сторінці. У поєднанні з областями застосування, це стає потужним інструментом для управління тим, де і коли відображаються ваші банери. Ви можете вибрати відображення банерів у шапці, боковій панелі або інших стратегічних місцях для максимізації їх видимості та впливу.',
        'render_location_options' => [
            'panel' => [
                'header' => 'Шапка',
                'page_start' => 'Початок сторінки',
                'page_end' => 'Кінець сторінки',
            ],
            'authentication' => [
                'login_form_before' => 'Перед формою входу',
                'login_form_after' => 'Після форми входу',
                'password_reset_form_before' => 'Перед формою скидання пароля',
                'password_reset_form_after' => 'Після форми скидання пароля',
                'register_form_before' => 'Перед формою реєстрації',
                'register_form_after' => 'Після форми реєстрації',
            ],
            'global_search' => [
                'before' => 'Перед глобальним пошуком',
                'after' => 'Після глобального пошуку',
            ],
            'page_widgets' => [
                'header_before' => 'Перед віджетами шапки',
                'header_after' => 'Після віджетів шапки',
                'footer_before' => 'Перед віджетами підвалу',
                'footer_after' => 'Після віджетів підвалу',
            ],
            'sidebar' => [
                'nav_start' => 'Перед навігацією бокової панелі',
                'nav_end' => 'Після навігації бокової панелі',
            ],
            'resource_table' => [
                'before' => 'Перед таблицею ресурсів',
                'after' => 'Після таблиці ресурсів',
            ],
        ],
        'scope' => 'Область застосування',
        'scope_help' => 'За допомогою області застосування ви можете контролювати, де буде відображатися ваш банер. Ви можете націлити банер на конкретні сторінки або ресурси в цілому, забезпечуючи його показ правильній аудиторії в потрібний час.',
        'options' => 'Опції',
        'can_be_closed_by_user' => 'Банер може бути закритий користувачем',
        'can_truncate_message' => 'Обрізає контент банера',
        'is_active' => 'Активний',
        'text_color' => 'Колір тексту',
        'icon' => 'Іконка',
        'icon_color' => 'Колір іконки',
        'background' => 'Фон',
        'background_type' => 'Тип фону',
        'background_type_solid' => 'Однотонний',
        'background_type_gradient' => 'Градієнт',
        'start_color' => 'Колір початку',
        'end_color' => 'Колір кінця',
        'start_time' => 'Час початку',
        'start_time_reset' => 'Скинути час початку',
        'end_time' => 'Час закінчення',
        'end_time_reset' => 'Скинути час закінчення',
    ],
    'badges' => [
        'scheduling_status' => [
            'active' => 'Активний',
            'scheduled' => 'Заплановано',
            'expired' => 'Закінчився',
        ],
    ],
    'actions' => [
        'help' => 'Допомога',
        'reset' => 'Скинути',
    ],
];
